[
    {
        "name": "Доктор",
        "text": "Фух, это были сложные вопросы, да? Но мы умные, поэтому смогли ответить на каждый из них. Правда не знаю зачем они нужны в этом ящике. Чтобы достать что-то из него, приходится постоянно решать загадки. Это странно."
    },
    {
        "name": "Доктор",
        "text": "В любом случае начнем наш тест."
    },
    {
        "background": "//textures//background//test.png"
    },
    {
        "name": "Доктор",
        "text": "Держи пустой бланк. И вот ручку."
    },
    {
        "text": "На листочке много вопросов."
    },
    {
        "name": "Доктор",
        "text": "[name], перед тем как приступить к тесту, хочешь узнать немного о депрессии?"
    },
    {
        "options": [
            {
                "label": "Да, но только вкратце", "value": "0"
            },
            {
                "label": "Не особо", "value": "1"
            }
        ],
        "variable-set": "flag1"
    },
    {
        "switch": [
            {
                "variable": "flag1", "equal": "1", "jump": "23"
            }
        ]
    },
    {
        "name": "Доктор",
        "text": "Что именно ты хочешь узнать?"
    },
    {
        "options": [
            {
                "label": "Что такое депрессия?", "value": "0"
            },
            {
                "label": "Какие симптомы у депрессии?", "value": "1"
            },
            {
                "label": "Насколько часто болеют депрессией?", "value": "2"
            },
            {
                "label": "Есть ли отличия между грустью и депрессией?", "value": "3"
            },
            {
                "label": "Из-за чего заболеваешь депрессией?", "value": "4"
            },
            {
                "label": "Как лечить депрессию?", "value": "5"
            },
            {
                "label": "Я узнал все, что нужно. Спасибо", "value": "6"
            }
        ],
        "variable-set": "flag1"
    },
    {
        "switch": [
            {
                "variable": "flag1", "equal": "1", "jump": "3"
            },
            {
                "variable": "flag1", "equal": "2", "jump": "7"
            },
            {
                "variable": "flag1", "equal": "3", "jump": "9"
            },
            {
                "variable": "flag1", "equal": "4", "jump": "13"
            },
            {
                "variable": "flag1", "equal": "5", "jump": "16"
            },
            {
                "variable": "flag1", "equal": "6", "jump": "20"
            }
        ]
    },
    {
        "name": "Доктор",
        "text": "Депрессия – это распространенное и серьезное психическое расстройство, негативно влияющее на настроение, образ мыслей и поведение. К счастью, это заболевание излечимо. Депрессия вызывает чувство грусти и/или потерю интереса к занятиям, которые раньше приносили удовольствие. Она может привести к разнообразным эмоциональным и психическим проблемам, а также снизить способность к выполнению ваших функций на работе и дома."
    },
    {
        "jump-to": "9"
    },
    {
        "name": "Доктор",
        "text": "Симптомы депрессии могут варьироваться от незначительных до серьезных и могут включать в себя: чувство грусти или подавленное настроение; потерю интереса к занятиям, которые увлекали раньше или потерю удовольствия от этих занятий; изменение аппетита – снижение или набор веса, не связанные с диетой; бессонницу либо слишком долгий сон; потерю энергии или повышенную утомляемость."
    },
    {
        "name": "Доктор",
        "text": "А также возрастание количества бессмысленных физических действий (например, неспособность усидеть на месте, хождение туда-сюда, движения руками), либо замедление движений и речи (эти симптомы должны быть достаточно выраженными, чтобы их заметили окружающие); чувства никчемности и вины; сложности в мышлении, концентрации и принятии решений; мысли о смерти или суициде."
    },
    {
        "name": "Доктор",
        "text": "Для постановки диагноза депрессии симптомы должны длиться не меньше двух недель и быть отличными от вашего обычного предыдущего состояния."
    },
    {
        "jump-to": "9"
    },
    {
        "name": "Доктор",
        "text": "Согласно оценкам, депрессией страдает каждый пятнадцатый взрослый человек (6.7%) в каждом конкретном году. Каждый шестой человек (16.6%) испытывает депрессию когда-либо в своей жизни. Депрессия может возникнуть в любом возрасте, но, чаще всего, впервые возникает в период от позднего подросткового возраста до середины третьего десятка. Женщины более подвержены депрессии, чем мужчины. Фактор наследственности (родители, дети, родные братья и сестры) оказывает существенное влияние (примерно 40%) на вероятность возникновения депрессии."
    },
    {
        "jump-to": "9"
    },
    {
        "name": "Доктор",
        "text": "Депрессия – это не то же самое, что грусть или скорбь. Смерть близких, потеря работы или разрыв отношений – события, которые человеку сложно пережить. Чувства грусти или скорби являются нормальными реакциями на такие события. В такие сложные периоды люди могут считать, что пребывают в депрессивном состоянии. Но грусть – это не то же самое, что депрессия. Скорбь естественна и уникальна для каждого человека, хотя и содержит некоторые одинаковые с депрессией черты. И скорбь, и депрессия включают в себя сильную тоску и отказ от привычных занятий."
    },
    {
        "name": "Доктор",
        "text": "Но в то же время есть существенные различия: в скорби болезненные чувства накатывают волнами, часто перемежаясь с позитивными воспоминаниями об умершем. При депрессии пониженное настроение и/или потеря интереса (удовольствия) продолжается более двух недель; при скорби самооценка как правило сохраняется, при депрессии же обычны чувство никчемности и отвращение к себе; при скорби мысли о смерти поверхностны и подразумевают фантазии о «воссоединении» с умершими любимыми людьми. При депрессии мысли сфокусированы на окончании своей жизни и обусловлены чувством никчемности или недостойности жить, или же невозможностью справиться с болью от депрессии."
    },
    {
        "name": "Доктор",
        "text": "Скорбь и депрессия могут существовать одновременно у некоторых людей. Смерть близких, потеря работы, стихийные бедствия и другие неприятные события могут привести к депрессии. Когда скорбь и депрессия накладываются друг на друга, скорбь имеет более тяжелый характер и продолжается дольше, чем скорбь отдельно от депрессии. Различение скорби и депрессии очень важно, и может помочь людям получить помощь, поддержку и лечение, в которых они нуждаются."
    },
    {
        "jump-to": "9"
    },
    {
        "name": "Доктор",
        "text": "Депрессия может затронуть любого человека, даже тех, чьи жизненные обстоятельства кажутся близкими к идеальным. Несколько факторов, которые могут сыграть роль в возникновении депрессии: Биохимия - особенности химического состава мозга могут способствовать появлению симптомов депрессии; Наследственность - депрессия может передаваться по наследству. Например, если депрессия появилась у одного из идентичных близнецов, то с вероятностью 70% второй близнец заболеет этой болезнью в течение своей жизни."
    },
    {
        "name": "Доктор",
        "text": "Личностные качества - люди с низкой самооценкой, которые легко впадают в состояние стресса или которые в целом пессимистичны, с большей вероятностью подвержены депрессии; Окружающая среда - постоянное пребывание в ситуациях насилия, пренебрежения, жестокости, нищеты может сделать некоторых людей более подверженными депрессии."
    },
    {
        "jump-to": "9"
    },
    {
        "name": "Доктор",
        "text": "Депрессия – одно из самых излечимых психических расстройств. От 80% до 90% людей с депрессией в итоге получают положительный результат от лечения. Практически все пациенты получают облегчение своих симптомов. Перед постановкой диагноза или назначения лечения специалист должен провести тщательное обследование, включая беседу и медицинский осмотр."
    },
    {
        "name": "Доктор",
        "text": "В некоторых случаях требуется анализ крови, чтобы убедиться, что симптомы депрессии не являются следствием состояния здоровья при наличии некоторых заболеваний. Обследование должно помочь выявить специфические симптомы, исследовать медицинскую и наследственную истории, культурные и средовые факторы, с целью постановки диагноза и определения мер лечения."
    },
    {
        "name": "Доктор",
        "text": "Диагностированная депрессия лечится психотерапевтическим и медикаментозным способом. Существуют способы, которыми люди могут самостоятельно уменьшить симптомы депрессии. У многих людей регулярные физические тренировки вызывают позитивные эмоции и повышают настроение. Достаточное количество сна на регулярной основе, здоровое питание, отказ от алкоголя также могут сократить симптомы депрессии."
    },
    {
        "jump-to": "9"
    },
    {
        "name": "Доктор",
        "text": "Ладно, закончим с этим. Тебе, наверное, невтерпеж уже пройти этот тест?"
    },
    {
        "name": "Доктор",
        "text": "Всего в тесте 20 вопросов. У каждого по четыре варианта ответа."
    },
    {
        "name": "Доктор",
        "text": "Можешь приступать."
    },

    {
        "text": "Первый вопрос: Как вы себя чувствовали на этой неделе и сегодня?"
    },
    {
        "options": [
            {
                "label": "Я не чувствую себя рассторенным, печальным.", "value": "0"
            },
            {
                "label": "Я расстроен.", "value": "1"
            },
            {
                "label": "Я все время расстроен и не могу от этого отключиться.", "value": "2"
            },
            {
                "label": "Я настолько расстроен и несчастлив, что не могу это выдержать.", "value": "3"
            }
        ],
        "variable-set": "test1"
    },
    {
        "text": "Второй вопрос: Как вы себя чувствовали на этой неделе и сегодня?"
    },
    {
        "options": [
            {
                "label": "Я не тревожусь о своем будущем.", "value": "0"
            },
            {
                "label": "Я чувствую, что озадачен будущим.", "value": "1"
            },
            {
                "label": "Я чувствую, что меня ничего не ждет в будущем.", "value": "2"
            },
            {
                "label": "Мое будущее безнадежно, и ничто не может измениться к лучшему.", "value": "3"
            }
        ],
        "variable-set": "test2"
    },
    {
        "text": "Третий вопрос: Как вы себя чувствовали на этой неделе и сегодня?"
    },
    {
        "options": [
            {
                "label": "Я не чувствую себя неудачником.", "value": "0"
            },
            {
                "label": "Я чувствую, что терпел больше неудач, чем другие люди.", "value": "1"
            },
            {
                "label": "Когда я оглядываюсь на свою жизнь, я вижу в ней много неудач.", "value": "2"
            },
            {
                "label": "Я чувствую, что как личность я – полный неудачник.", "value": "3"
            }
        ],
        "variable-set": "test3"
    },
    {
        "text": "Четвертый вопрос: Как вы себя чувствовали на этой неделе и сегодня?"
    },
    {
        "options": [
            {
                "label": "Я получаю столько же удовлетворения от жизни, как раньше.", "value": "0"
            },
            {
                "label": "Я не получаю столько же удовлетворения от жизни, как раньше.", "value": "1"
            },
            {
                "label": "Я больше не получаю удовлетворения ни от чего.", "value": "2"
            },
            {
                "label": "Я полностью не удовлетворен жизнью, и мне все надоело.", "value": "3"
            }
        ],
        "variable-set": "test4"
    },
    {
        "text": "Пятый вопрос: Как вы себя чувствовали на этой неделе и сегодня?"
    },
    {
        "options": [
            {
                "label": "Я не чувствую себя в чем-нибудь виноватым.", "value": "0"
            },
            {
                "label": "Достаточно часто я чувствую себя виноватым.", "value": "1"
            },
            {
                "label": "Большую часть времени я чувствую себя виноватым.", "value": "2"
            },
            {
                "label": "Я постоянно испытываю чувство вины.", "value": "3"
            }
        ],
        "variable-set": "test5"
    },
    {
        "text": "Шестой вопрос: Как вы себя чувствовали на этой неделе и сегодня?"
    },
    {
        "options": [
            {
                "label": "Я не чувствую, что могу быть наказанным за что-либо.", "value": "0"
            },
            {
                "label": "Я чувствую, что могу быть наказан.", "value": "1"
            },
            {
                "label": "Я ожидаю, что могу быть наказан.", "value": "2"
            },
            {
                "label": "Я чувствую себя уже наказанным.", "value": "3"
            }
        ],
        "variable-set": "test6"
    },
    {
        "text": "Седьмой вопрос: Как вы себя чувствовали на этой неделе и сегодня?"
    },
    {
        "options": [
            {
                "label": "Я не разочаровался в себе.", "value": "0"
            },
            {
                "label": "Я разочаровался в себе.", "value": "1"
            },
            {
                "label": "Я себе противен.", "value": "2"
            },
            {
                "label": "Я себя ненавижу.", "value": "3"
            }
        ],
        "variable-set": "test7"
    },
    {
        "text": "Восьмой вопрос: Как вы себя чувствовали на этой неделе и сегодня?"
    },
    {
        "options": [
            {
                "label": "Я знаю, что я не хуже других.", "value": "0"
            },
            {
                "label": "Я критикую себя за ошибки и слабости.", "value": "1"
            },
            {
                "label": "Я все время обвиняю себя за свои поступки.", "value": "2"
            },
            {
                "label": "Я виню себя во всем плохом, что происходит.", "value": "3"
            }
        ],
        "variable-set": "test8"
    },
    {
        "text": "Девятый вопрос: Как вы себя чувствовали на этой неделе и сегодня?"
    },
    {
        "options": [
            {
                "label": "Я никогда не думал покончить с собой.", "value": "0"
            },
            {
                "label": "Ко мне приходят мысли покончить с собой, но я не буду их осуществлять.", "value": "1"
            },
            {
                "label": "Я хотел бы покончить с собой.", "value": "2"
            },
            {
                "label": "Я бы убил себя, если бы представился случай.", "value": "3"
            }
        ],
        "variable-set": "test9"
    },
    {
        "text": "Десятый вопрос: Как вы себя чувствовали на этой неделе и сегодня?"
    },
    {
        "options": [
            {
                "label": "Я плачу не больше, чем обычно.", "value": "0"
            },
            {
                "label": "Сейчас я плачу чаще, чем раньше.", "value": "1"
            },
            {
                "label": "Теперь я все время плачу.", "value": "2"
            },
            {
                "label": "Раньше я мог плакать, а сейчас не могу, даже если мне хочется.", "value": "3"
            }
        ],
        "variable-set": "test10"
    },
    {
        "background": "none"
    },

    {
        "name": "Доктор",
        "text": "Довольно гнетущие вопросы, да?"
    },
    {
        "name": "Доктор",
        "text": "От таких вопросов, если депрессии нету, обязательно её получишь, ха-ха-хах."
    },
    {
        "name": "Доктор",
        "text": "Шучу, конечно."
    },
    {
        "name": "Доктор",
        "text": "Открою-ка я окошко. Как-то душновато в комнате стало."
    },
    {
        "text": "Доктор, махая на себя листочком, потянулся к окну."
    },
    {
        "background": "//textures//background//window.png"
    },
    {
        "name": "Доктор",
        "text": "О нет!"
    },
    {
        "text": "Окно резко раскрылось, и сильный ветер залетел в комнату."
    },
    {
        "text": "Все листочки на столе доктора вмиг поднялись и полетели вслед за ветром."
    },
    {
        "name": "Доктор",
        "text": "Хватай их!"
    },
    {
        "text": "Доктор закрыл окно. Но было уже поздно. Ветер открыл дверь в комнату отдыха и запустил все листочки туда."
    },
    {
        "scene": "//scenes//levels//DoctorsOfficeAfter.tscn"
    }
]